HELYXcore-4.4.0/examples/legacy/multiphase/twoPhaseEulerFoam/RAS/bubbleColumn/constant/turbulenceProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel mixtureKEpsilon; //LaheyKEpsilon;

    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
